#coding: utf-8
#Задача 1
x=int(input("Введите число x = "))
y=7*x+5
print ("Ответ y = ", y)

#Задача 2
a=int(input("Введите число a = "))
y=a+a+a+a
print ("Ответ a = ", a)

#Задача 3
i=int(input("Введите число i = "))
I=2*3.14*1
print ("Ответ I = ", I)

#Задача 4
S=int(input("введите число S"))
S = 2*2/4*3.14
print ("Ответ S = ", S)

#Задача 5
c=int(input("Введите число c = "))
c=4*4+2*2
print ("Ответ c = ", c)

#Задача  6
P=int(input("Введите число P"))
P =2*3+2
print ("Ответ P = ", P)
